Public Attributes | List of all members
API_ToolBoxItem Struct Reference
Element Manager API
Data of the active toolbox mode. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_ElemType  | type
Toolbox item element type.
Detailed Description
Data of the active toolbox mode.
Since
Archicad 26
Remarks
For the utilization of this structure see the ACAPI_Toolbox_GetToolBoxMode and the ACAPI_Toolbox_SetToolBoxMode environment functions. From version 26 the typeID and variationID members were merged into an API_ElemType structure.
Member Data Documentation
◆ type
 API_ToolBoxItem::type
Toolbox item element type.